app/controllers/games_controller.rb

SELECT * FROM `games` WHERE (`games`.`name` = 'game') LIMIT 1
---
  def find_game
    pp params
    game = Game.find_by_name(params["search_tag"])