app/controllers/game_list_controller.rb

SELECT `games`.* FROM `games` INNER JOIN game_information_maps ON games.id = game_information_maps.game_id WHERE ((`game_information_maps`.user_id = 2))
---
  def index
    @user = User.find(:first, :conditions => ["lower(login) = ?", params["user"].downcase])
    games = @user.games.sort {|game1, game2| game1["name"] <=> game2["name"]}
    @currently_playing = []
    @hiatus = []
    @planned_games = []
    @completed = []
    games.each do |game|