app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user["avatar"] = "https://s3.amazonaws.com/gamer-ryoudan-avatars/Avatars/default.png"
    password = params["user"]["password"]
    if @user.save
---
INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('fWSkhMXwPV2OA8USKcgw', '2010-07-29 01:22:33', '2010-07-29 01:22:33', 'b27c5193ce369131319ba07cda1d1be367c2d3edc8b0d92ada0600e9779700f62144a656b660c12869e7edcf0690b3e969c18b3d0c9ed87ef0d6b7d0460ba6f4', 'cqja0quTC3MiKtDB4mqK', '2010-07-29 01:22:33', 0, '127.0.0.1', 'DLMSMnJEZ9NvKt3HocpS', '2010-07-29 01:22:33', '10e2f9477af64769c3e3f9b3c06eb97e4533e1ac31f5a5799c835c3c58b3def92e841ce7c004655b00aeb43d6e12b30bff26957ed067e48716d9f8ccd2fb690e', 1, NULL, 'login1', NULL, 'b@b.com')